GitGriever/Game/Keil_v5/ARM/Boards/ST/STM32072B-EVAL/Blinky/GLCD_SPI_STM32F0xx.c
/*----------------------------------------------------------------------------
 * Name:    GLCD_SPI_STM32F0xx.c
 * Purpose: low level Graphic LCD (320x240 pixels) driven with SPI functions
 * Note(s): used on STM32052B-EVAL board
 *----------------------------------------------------------------------------
 * This file is part of the uVision/ARM development tools.
 * This software may only be used under the terms of a valid, current,
 * end user licence from KEIL for a compatible version of KEIL software
 * development tools. Nothing else gives you the right to use this software.
 *
 * This software is supplied "AS IS" without warranties of any kind.
 *
 * Copyright (c) 2013 Keil - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/


#include <stm32f0xx.h>                  /* STM32F0xx.h definitions            */
#include "GLCD.h"
#include "Font_6x8_h.h"
#include "Font_16x24_h.h"

/************************** Orientation  configuration ************************/

#define LANDSCAPE   1                   /* 1 for landscape, 0 for portrait    */
#define ROTATE180   0                   /* 1 to rotate the screen for 180 deg */

/*********************** Hardware specific configuration **********************/

/* SPI Interface: SPI1

   PINS:
   - CS     = PE6  (GPIO pin)
   - RS     = GND
   - WR/SCK = PB3  (SPI1_SCK)
   - RD     = GND
   - SDO    = PE14 (SPI1_MISO)
   - SDI    = PE15 (SPI1_MOSI)                                                */

#define PIN_CS      (1UL <<  6)
#define PIN_CLK     (1UL <<  3)
#define PIN_DAT     (1UL << 15)

#define IN          0x00
#define OUT         0x01

/* SPI_SR - bit definitions                                                   */
#define RXNE        0x01

/*------------------------- Speed dependant settings -------------------------*/

/* If processor works on high frequency delay has to be increased, it can be
   increased by factor 2^N by this constant                                   */
#define DELAY_2N    10

/*---------------------- Graphic LCD size definitions ------------------------*/

#if (LANDSCAPE == 1)
#define WIDTH       320                 /* Screen Width (in pixels)           */
#define HEIGHT      240                 /* Screen Hight (in pixels)           */
#else
#define WIDTH       240                 /* Screen Width (in pixels)           */
#define HEIGHT      320                 /* Screen Hight (in pixels)           */
#endif
#define BPP         16                  /* Bits per pixel                     */
#define BYPP        ((BPP+7)/8)         /* Bytes per pixel                    */

/*--------------- Graphic LCD interface hardware definitions -----------------*/

/* Pin CS setting to 0 or 1                                                   */
#define LCD_CS(x)   ((x)        ? (GPIOE->BSRR   = (PIN_CS   <<    0)) : (GPIOE->BSRR   = (PIN_CS    <<   16)) );
#define LCD_CLK(x)  ((x)        ? (GPIOB->BSRR   = (PIN_CLK  <<    0)) : (GPIOB->BSRR   = (PIN_CLK   <<   16)) );
#define LCD_DAT(x)  ((x)        ? (GPIOE->BSRR   = (PIN_DAT  <<    0)) : (GPIOE->BSRR   = (PIN_DAT   <<   16)) );

#define DAT_MODE(x)  (x == OUT) ? (GPIOB->BSRR   = ((1ul<<2) <<    0)) : (GPIOB->BSRR   =  ((1ul<<2) <<   16)); \
                     (x == OUT) ? (GPIOE->MODER |= ( 1UL     << 2*15)) : (GPIOE->MODER &= ~( 3UL     << 2*15));
#define BUS_VAL()   ((GPIOE->IDR & PIN_DAT) != 0)


#define SPI_START   (0x70)              /* Start byte for SPI transfer        */
#define SPI_RD      (0x01)              /* WR bit 1 within start              */
#define SPI_WR      (0x00)              /* WR bit 0 within start              */
#define SPI_DATA    (0x02)              /* RS bit 1 within start byte         */
#define SPI_INDEX   (0x00)              /* RS bit 0 within start byte         */

#define BG_COLOR  0                     /* Background color                   */
#define TXT_COLOR 1                     /* Text color                         */


/*---------------------------- Global variables ------------------------------*/

/******************************************************************************/
static volatile unsigned short Color[2] = {White, Black};
static unsigned char Himax;

/************************ Local auxiliary functions ***************************/

/*******************************************************************************
* Delay in while loop cycles                                                   *
*   Parameter:    cnt:    number of while cycles to delay                      *
*   Return:                                                                    *
*******************************************************************************/

static void delay (int cnt) {
  cnt <<= DELAY_2N;
  while (cnt--) __NOP();
}


/*******************************************************************************
* Transfer 1 byte over the serial communication                                *
*   Parameter:    byte:   byte to be sent                                      *
*                 mode:   OUT = transmit byte, IN = receive byte               *
*   Return:               byte read while sending                              *
*******************************************************************************/
static unsigned char spi_tran_man (unsigned char byte, unsigned int mode) {
  unsigned char val = 0;
  int i;

  if (mode == OUT) { DAT_MODE (OUT); }
  else             { DAT_MODE (IN);  }

  for (i = 7; i >= 0; i--) {
    LCD_CLK(0);
    delay(1);
    if (mode == OUT) {
      LCD_DAT((byte & (1 << i)) != 0);
    }
    else {
      val |= (BUS_VAL() << i);
    }
    LCD_CLK(1);
    delay(1);
  }
  return (val);
}


/*******************************************************************************
* Transfer 1 byte over the serial communication                                *
*   Parameter:    byte:   byte to be sent                                      *
*   Return:               byte read while sending                              *
*******************************************************************************/

static __inline unsigned char spi_tran (unsigned char byte) {

  *((volatile uint8_t *)&(SPI1->DR)) = byte;   /* 8bit access because of 8 databits  */
  while (!(SPI1->SR & RXNE));           /* Wait for send to finish            */
  return (*((volatile uint8_t *)&(SPI1->DR))); /* 8bit access because of 8 databits  */
}


