GitGriever/Game/Keil_v5/ARM/Boards/ST/STM32072B-EVAL/Blinky/GLCD_SPI_STM32F0xx.c
  LCD_CS(0);
  spi_tran_man (SPI_START | SPI_WR | SPI_INDEX, OUT);
  spi_tran_man (0x00, OUT);
  LCD_CS(1);

  LCD_CS(0);
  spi_tran_man (SPI_START | SPI_RD | SPI_DATA, OUT);
  val = spi_tran_man(0, IN);
  LCD_CS(1);


  GPIOB->ODR     |=  (1UL <<    2);              /* set PB.2 to High          */

/* SPI1_SCK, SPI1_MISO, SPI1_MOSI are SPI pins                                */
  GPIOB->MODER   &= ~(( 3UL << (2* 3))  );
  GPIOB->MODER   |=  (( 2UL << (2* 3))  );       /* Alternate Function mode   */
  GPIOE->MODER   &= ~(( 3UL << (2*14)) |
                      ( 3UL << (2*15))  );
  GPIOE->MODER   |=  (( 2UL << (2*14)) |
                      ( 2UL << (2*15))  );       /* Alternate Function mode   */

  return (val);
}


/************************ Exported functions **********************************/

/*******************************************************************************
* Initialize the Graphic LCD controller                                        *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_Init (void) {
  unsigned short driverCode;

  /* Enable clock for GPIOB, E and SPI1                                       */
  RCC->AHBENR  |= (( 1UL << 21) | (1UL << 18));
  RCC->APB2ENR |=  ( 1UL << 12);

  /* NCS is PE6, GPIO output set to high                                      */
  GPIOE->ODR     |=  ( 1UL << (   6));           /* set Pin to High           */
  GPIOE->MODER   &= ~( 3UL << (2* 6));
  GPIOE->MODER   |=  ( 1UL << (2* 6));           /* Gen. purpose output mode  */

  /* SPI1_SCK, SPI1_MISO, SPI1_MOSI are SPI pins                              */
  GPIOB->OSPEEDR |=  (( 3UL << (2* 3)));
  GPIOE->OSPEEDR |=  (( 3UL << (2*14)) |
                      ( 3UL << (2*15))  );

  GPIOB->MODER   &= ~(( 3UL << (2* 3))  );
  GPIOB->MODER   |=  (( 2UL << (2* 3))  );       /* Alternate Function mode   */
  GPIOE->MODER   &= ~(( 3UL << (2*14)) |
                      ( 3UL << (2*15))  );
  GPIOE->MODER   |=  (( 2UL << (2*14)) |
                      ( 2UL << (2*15))  );       /* Alternate Function mode   */

  GPIOB->AFR[0]  &= ~((15UL << (4*( 3  )))  );   /* Alternate Function 0      */
  GPIOE->AFR[1]  &= ~((15UL << (4*(14-8))) |
                      (15UL << (4*(15-8)))  );
  GPIOE->AFR[1]  |=  (( 1UL << (4*(14-8))) |
                      ( 1UL << (4*(15-8)))  );   /* Alternate Function 1      */


  /* Enable SPI in Master Mode, CPOL=1, CPHA=1                                */
  /* Max. 12 MBit used for Data Transfer @ 48MHz                              */
  RCC->APB2RSTR |=  (1UL << 12);                 /* start SPI1 reset          */
  RCC->APB2RSTR &= ~(1UL << 12);                 /* stop  SPI1 reset          */

  SPI1->CR1  = ((1UL <<  0) |                    /* CPHA = 1                  */
                (1UL <<  1) |                    /* CPOL = 1                  */
                (1UL <<  3) |                    /* BR = 1   = fPCLK / 4      */
                (1UL <<  9)  );                  /* SSM = 1                   */

  SPI1->CR2  = ((7UL <<  8) |                    /* DS = 7   = 8bit           */
                (1UL << 12)  );                  /* FRXTH = 1                 */

  SPI1->CR1 |= ((1UL <<  2) |                    /* MSTR = 1                  */
                (1UL <<  8)  );                  /* SSI = 1                   */

  SPI1->CR1 |=  (1UL <<  6);                     /* SPE = 1                   */

  driverCode = rd_id_man ();
  if ((driverCode == 0x00) || (driverCode == 0xFF)) {
    driverCode = rd_reg(0x00);
  }

  if (driverCode == 0x47) {             /* LCD with HX8347-D LCD Controller   */
    Himax = 1;                          /* Set Himax LCD controller flag      */
    /* Driving ability settings ----------------------------------------------*/
    wr_reg(0xEA, 0x00);                 /* Power control internal used (1)    */
    wr_reg(0xEB, 0x20);                 /* Power control internal used (2)    */
    wr_reg(0xEC, 0x0C);                 /* Source control internal used (1)   */
    wr_reg(0xED, 0xC7);                 /* Source control internal used (2)   */
    wr_reg(0xE8, 0x38);                 /* Source output period Normal mode   */
    wr_reg(0xE9, 0x10);                 /* Source output period Idle mode     */
    wr_reg(0xF1, 0x01);                 /* RGB 18-bit interface ;0x0110       */
    wr_reg(0xF2, 0x10);

    /* Adjust the Gamma Curve ------------------------------------------------*/
    wr_reg(0x40, 0x01);
    wr_reg(0x41, 0x00);
    wr_reg(0x42, 0x00);
    wr_reg(0x43, 0x10);
    wr_reg(0x44, 0x0E);
    wr_reg(0x45, 0x24);
    wr_reg(0x46, 0x04);
    wr_reg(0x47, 0x50);
    wr_reg(0x48, 0x02);
    wr_reg(0x49, 0x13);
    wr_reg(0x4A, 0x19);
    wr_reg(0x4B, 0x19);
    wr_reg(0x4C, 0x16);

    wr_reg(0x50, 0x1B);
    wr_reg(0x51, 0x31);
    wr_reg(0x52, 0x2F);
    wr_reg(0x53, 0x3F);
    wr_reg(0x54, 0x3F);
    wr_reg(0x55, 0x3E);
    wr_reg(0x56, 0x2F);
    wr_reg(0x57, 0x7B);
    wr_reg(0x58, 0x09);
    wr_reg(0x59, 0x06);
    wr_reg(0x5A, 0x06);
    wr_reg(0x5B, 0x0C);
    wr_reg(0x5C, 0x1D);
    wr_reg(0x5D, 0xCC);

    /* Power voltage setting -------------------------------------------------*/
    wr_reg(0x1B, 0x1B);
    wr_reg(0x1A, 0x01);
    wr_reg(0x24, 0x2F);
    wr_reg(0x25, 0x57);
    wr_reg(0x23, 0x88);

    /* Power on setting ------------------------------------------------------*/
    wr_reg(0x18, 0x36);                 /* Internal oscillator frequency adj  */
    wr_reg(0x19, 0x01);                 /* Enable internal oscillator         */
    wr_reg(0x01, 0x00);                 /* Normal mode, no scrool             */
    wr_reg(0x1F, 0x88);                 /* Power control 6 - DDVDH Off        */
    delay(20);
    wr_reg(0x1F, 0x82);                 /* Power control 6 - Step-up: 3 x VCI */
    delay(5);
    wr_reg(0x1F, 0x92);                 /* Power control 6 - Step-up: On      */
    delay(5);
    wr_reg(0x1F, 0xD2);                 /* Power control 6 - VCOML active     */
    delay(5);

